simulation/openfoam/tjunction_2d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// T-Junction with 4 CONNECTED blocks
// Added junction block to connect all regions

scale 1;

vertices
(
    // y=0 row (bottom)
    (0          0         0)         // 0
    (0.0005375  0         0)         // 1
    (0.0006125  0         0)         // 2
    (0.00165    0         0)         // 3
    
    // y=0.00015 row (top of main channel)
    (0          0.00015   0)         // 4
    (0.0005375  0.00015   0)         // 5
    (0.0006125  0.00015   0)         // 6
    (0.00165    0.00015   0)         // 7
    
    // y=0.00045 row (top of water inlet)
    (0.0005375  0.00045   0)         // 8
    (0.0006125  0.00045   0)         // 9
    
    // Back plane z=0.00008
    (0          0         0.00008)   // 10
    (0.0005375  0         0.00008)   // 11
    (0.0006125  0         0.00008)   // 12
    (0.00165    0         0.00008)   // 13
    
    (0          0.00015   0.00008)   // 14
    (0.0005375  0.00015   0.00008)   // 15
    (0.0006125  0.00015   0.00008)   // 16
    (0.00165    0.00015   0.00008)   // 17
    
    (0.0005375  0.00045   0.00008)   // 18
    (0.0006125  0.00045   0.00008)   // 19
);

blocks
(
    // Block 0: Left main channel (oil inlet to junction)
    hex (0 1 5 4 10 11 15 14) (107 30 1) simpleGrading (1 1 1)
    
    // Block 1: Junction block (connects everything!)
    // This fills the gap at y < 0.00015 between blocks 0 and 2
    hex (1 2 6 5 11 12 16 15) (15 30 1) simpleGrading (1 1 1)
    
    // Block 2: Right main channel (junction to outlet)
    hex (2 3 7 6 12 13 17 16) (207 30 1) simpleGrading (1 1 1)
    
    // Block 3: Water inlet (on top of junction block)
    hex (5 6 9 8 15 16 19 18) (15 60 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    oil_inlet
    {
        type patch;
        faces
        (
            (0 10 14 4)
        );
    }
    
    water_inlet
    {
        type patch;
        faces
        (
            (8 9 19 18)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (3 7 17 13)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            // Bottom wall (y=0)
            (0 1 11 10)
            (1 2 12 11)
            (2 3 13 12)
            
            // Top wall (y=0.00015, left and right of water inlet)
            (4 14 15 5)
            (6 16 17 7)
            
            // Water inlet side walls
            (5 15 18 8)
            (9 19 16 6)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            // Front (z=0)
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (5 8 9 6)
            
            // Back (z=0.00008)
            (10 11 15 14)
            (11 12 16 15)
            (12 13 17 16)
            (15 16 19 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
