simulation/openfoam/tjunction_2d/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Two-phase flow properties for T-junction microfluidic droplet generation
// Based on parameters from microfluidic_chamber_plan.md

// Phase names
phases          (water oil);

// ============================================================================
// WATER (Dispersed Phase) - forms droplets
// ============================================================================
water
{
    transportModel  Newtonian;
    
    // Kinematic viscosity: nu = mu / rho
    // mu = 0.001 Pa.s (dynamic viscosity at 20°C)
    // rho = 1000 kg/m³
    // nu = 0.001 / 1000 = 1e-6 m²/s
    nu              1e-06;
    
    // Density
    rho             1000;
}

// ============================================================================
// OIL (Continuous Phase) - carrier fluid
// ============================================================================
oil
{
    transportModel  Newtonian;
    
    // Silicone oil, 50 cSt (centistokes)
    // 50 cSt = 50e-6 m²/s = 5e-5 m²/s kinematic viscosity
    // Dynamic viscosity: mu = nu * rho = 5e-5 * 960 = 0.048 Pa.s
    nu              5e-05;
    
    // Density (typical for 50 cSt silicone oil)
    rho             960;
}

// ============================================================================
// INTERFACIAL TENSION
// ============================================================================

// Surface tension between oil and water phases
// With 2% Span 80 surfactant in oil phase
// Typical value: 0.02-0.04 N/m depending on surfactant concentration
sigma           0.03;

// ************************************************************************* //


