simulation/openfoam/tjunction_2d/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oil_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    water_inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    walls
    {
        // OpenFOAM 11 uses 'contactAngle' instead of 'constantAlphaContactAngle'
        type            contactAngle;
        theta0          120;
        limit           gradient;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
    
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
